import { CommonModule } from '@angular/common';
import { Component, OnInit } from '@angular/core';
import { TranslateModule, TranslateService } from '@ngx-translate/core';

@Component({
  selector: 'app-policestwo',
  standalone: true,
  imports: [CommonModule,TranslateModule],
  templateUrl: './policestwo.component.html',
  styleUrl: './policestwo.component.scss'
})
export class PolicestwoComponent implements OnInit{
  policeContent: string[] = [];
  currentLanguage:any

  constructor(  private translate: TranslateService
    ) {
      // Determine the language direction dynamically
      this.currentLanguage = localStorage.getItem('language') || 'en';
  }
  ngOnInit(): void {
    this.loadPoliceContent();
  }

  loadPoliceContent(): void {
    this.policeContent = [
      'نرحب بزوار موقع مؤسسة سعود بن راشد المعلا للأعمال الخيرية والانسانية الكرام، ونؤكد على قراءة شروط الاستخدام التالية بعناية قبل الدخول إلى الموقع الإلكتروني، لأنها شروط وأحكام تنطبق عليك بمجرد استخدامك للموقع.',
      'يخضع استخدامك لهذا الموقع الإلكتروني والمواد والخدمات المتوفرة فيه أو عبره (يشار إليها مجتمعة بـ “الموقع الإلكتروني”) للشروط والأحكام (“شروط الاستخدام”) بالإضافة إلى قوانين دولة الإمارات العربية المتحدة...',
      'جميع حقوق الملكية الفكرية وطباعة ونشر المعلومات وعلامات البوابة الالكتروني محمية وفقاً للقوانين المنظمة لذلك بدولة الإمارات العربية المتحدة ومؤسسة سعود بن راشد المعلا للأعمال الخيرية والانسانية هي المالك الوحيد والحصري لها...',
      'لا يحق نشر أية مواد على البوابة الالكترونية الخاصة بالموقع الالكتروني التابع لمؤسسة سعود بن راشد المعلا للأعمال الخيرية والانسانية من قبل أي مستخدم ويتحمل المستخدم المسؤولية التامة عن قيامه بذلك...',
      'إن شروط المستخدم للبوابة الالكترونية الخاصة بمؤسسة سعود بن راشد المعلا للأعمال الخيرية والانسانية تحكم وتفسر وفقاً لقوانين دولة الإمارات العربية المتحدة...',
      'يوافق المستخدم على أنه لن يقوم بانتحال شخصية أي شخص، أو التعريف بنفسه بطريقة خاطئة عند استعمالك لخدمات بوابة التبرعات الالكترونية التابعة للجمعية...',
      'للجمعية الحق في إلغاء أو إنهاء أو تعليق الدخول لاستخدام البوابة والموقع الاإلكتروني لأي سبب كان ودون إشعار مسبق سواء بإبداء أسباب ذلك أو التحفظ بها وفقاً لمبدأ الخصوصية والسرية...',
      'تحتفظ مؤسسة سعود بن راشد المعلا للأعمال الخيرية والانسانية بحقها في تحديث وتغيير هذه الشروط والأحكام في أي وقت.'
    ];
  }
}
